Revit 2027 API
ExtendedPropertiesLinkData.AddParameterSchemaWithBindings Method
 Adds a schema id to the extended properties link.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddParameterSchemaWithBindings(
	ForgeTypeId schemaId,
	ExtendedPropertiesBindings bindings
)
Public Sub AddParameterSchemaWithBindings (
	schemaId As ForgeTypeId,
	bindings As ExtendedPropertiesBindings
)
public:
void AddParameterSchemaWithBindings(
	ForgeTypeId^ schemaId,
	ExtendedPropertiesBindings^ bindings
)
member AddParameterSchemaWithBindings :
        schemaId : ForgeTypeId *
        bindings : ExtendedPropertiesBindings -> unit
Parameters
schemaId ForgeTypeId
 Identifier of the schema to add.
bindings ExtendedPropertiesBindings
 The bindings for the schema.
Exceptions
Exception | Condition
ArgumentException |  The ForgeTypeId represents a malformed schema identifier. -or- Thrown when the schemaId already contains bindings.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace